Вам предстоит создать простое приложение на Vue.js для
отображения списка фильмов. У вас есть массив объектов с
информацией о фильмах, и вы должны создать два компонента:
родительский компонент "Список фильмов" и дочерний компонент
"Информация о фильме".
Родительский компонент "Список фильмов" будет отображать список
фильмов, используя дочерний компонент "Информация о фильме"
для отображения дополнительных деталей о каждом фильме по
клику.
1. Создайте родительский компонент "MovieList", который содержит список фильмов.
2. Создайте дочерний компонент "MovieInfo", который отображает информацию о фильме и может передавать данные о фильме обратно в родительский компонент.
3. Импортируйте дочерний компонент в родительский компонент.
4. Передайте информацию о фильмах из родительского компонента в дочерний компонент через props.
5. При клике на каждый элемент списка фильмов в дочернем компоненте "MovieInfo" показывайте или скрывайте дополнительные детали о фильме.
6. При клике на кнопку в дочернем компоненте "MovieInfo", передайте некоторую информацию о фильме обратно в родительский компонент.
7. В родительском компоненте отобразите информацию о фильме, которую вы получили от дочернего компонента.

<template>
  <div>
    <h2>Список фильмов</h2>
    <ul>
      <MovieInfo :movie="movie" v-for="movie in movies" :key="movie.id" @info-updated="handleInfoUpdate"/>
    <div>{{ newDetails }}</div>
    </ul>
  </div>
</template>

<script>
import MovieInfo from './MovieInfo.vue'

export default {
  name: 'MovieList',
  components: {
    MovieInfo
  },
  props: {},
  data() {
    return {
      movies: [
        {id: 1, title: 'Фильм 1', director: 'Режиссер 1', year: 2020, details: 'Какие то детали'},
        {id: 2, title: 'Фильм 2', director: 'Режиссер 2', year: 2019, details: ''},
        {id: 3, title: 'Фильм 3', director: 'Режиссер 3', year: 2021, details: 'И тут детали'}
      ],
      newDetails: ''
    };
  },
  methods: {
    handleInfoUpdate(details) {
      this.newDetails = details;
    }
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>

</style>
